<template>
  <div id='modal__wrapper'>
    <div class="blank">
      <div class="h__block">
        <h2>Обработка данных</h2>
        <img src="@/assets/images/closingbtn.svg" alt="" @click='hideModal'>
      </div>
      Настоящая политика конфиденциальности (далее — Политика) действует в отношении всей информации, включая персональные данные в понимании применимого законодательства (далее — «Персональная информация»), которую ООО «Гросс маркет» и/или его аффилированные лица, в том числе входящие в одну группу с ООО «Гросс маркет» (далее — «Гросс маркет»), могут получитьо Вас в процессе использования Вами любых сайтов, программ, продуктов и/или сервисов Гросс маркет (далее вместе  «Сервисы»), информацию о которых Гросс маркет может также получать Персональную информацию от своих партнеров (далее — «Партнеры»), сайты, программы, продукты или сервисы которых Вы используете (например, от рекламодателей Гросс маркет или службами такси). В таких случаях передача Персональной информации возможна только в случаях, установленных применимым законодательством, и осуществляется на основании специальных договоров между Гросс маркет и каждым из Партнеров.

      Пожалуйста, обратите внимание, что использование любого из Сайтов и/или Сервисов может регулироваться дополнительными условиями, которые могут вносить в настоящую Политику изменения и/или дополнения, и/или иметь специальные условия в отношении персональной информации, размещенные в соответствующих разделах документов для таких Сайтов /или Сервисов.
<br>
<br>
2. Кто обрабатывает информацию
<br>
<br>
Для обеспечения использования Вами Сайтов и Сервисов Ваша Персональная информация собирается и используется Яндексом, в том числе включая общество с ограниченной ответственностью «Гросс маркет», юридическое лицо, созданное по законодательству Российской Федерации и зарегистрированное по адресу: 123351, Россия, Москва, ул. Гроссова, д. 12 (ООО «Гросс маркет»), или его аффилированным лицом, предоставляющим соответствующий Сервис в иных юрисдикциях. С информацией о том, какое лицо предоставляет тот или иной Сервис, Вы можете ознакомиться в условиях использования соответствующего Сервиса.
    </div>
  </div>
</template>

<script>
export default {
  data(){
    return{
      
    }
  },
  methods:{
    hideModal(){
      let dataModal = document.getElementById('modal__wrapper');
      dataModal.classList.add('hideModal');
      setTimeout(()=>{
        dataModal.classList.remove('hideModal')
        dataModal.classList.remove('showModal')
        dataModal.style.display='none'
        
      },500)
    }
  }
}
</script>

<style lang='less'>
@import '~@/assets/css/styles.less';
  #modal__wrapper{
    position:fixed;
    top: 0;
    right: 0;
    bottom: 0;
    left: 0;
    overflow-x: hidden;
    overflow-y: auto;
    padding:70px 160px;
    min-height: 100vh;
    background:rgba(0,0,0,.4);
    border-radius:0;
    z-index:10;
    display:none;
    opacity:0;
    transform: translateY(5%);
  }
  .blank{
    background:#ffffff;
    padding:40px;
    min-height: 100vh;
    z-index:11;
    opacity: 1;
    text-align: left;
    .h__block{
      padding-right: 0;
      h2{
        margin:20px 0;
      }
    }
  }
    @media screen and(max-width:1112px){
      #modal__wrapper{
        padding:70px 40px;
      }
    }
    @media screen and(max-width:768px){
      #modal__wrapper{
        padding:0px;
        
      }
      .blank{
        border-radius: 0 !important;
      }
    }
</style>